Autodesk.Revit.DB.Analysis.AnalysisResultSchema.SetUnits(System.Collections.Generic.IList`1{System.String},System.Collections.Generic.IList`1{System.Double})
Sets names and multipliers of all units for result visualization
names:
Unit names for all units (e.g., "Lb" and "Kg")
multipliers:
Numerical coefficients mapped to unit names.
They adjust measurement values shown in the legend and display (e.g., 1.0 and 0.451 - if actual measurements are in Lb)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
names is zero-length or contains duplicate or empty names
-or-
multipliers contains non-positive numbers, or its length is not equal to the length of names
Since:
2012